package com.hk.test;

public class Question1 {
	public static void main(String[] args) {
		//변수를 사용하여 10, 3을 더한 결과 값을 출력
		//변수를 사용하여 10, 3을 곱한 결과 값을 출력
		
		int num1 = 10;
		int num2 = 3;
		
		System.out.println("10 + 3 = " + (num1+num2));
		System.out.println("10 + 3 = " + (num1*num2));
	}
}

/*

(4) C
1972년에 개발된 언어로, UNIX 운영체제 구현에 사용되는 언어이다. 범용 언어로
개발되었으나 문법의 간결성, 효율적 실행, 효과적인 포인터 타입 제공이라는 특징으
로 인해 가장 많이 사용되는 시스템 프로그래밍 언어가 되었다.

(5) C++
C 언어를 발전시킨 언어로 클래스, 상속 등을 제공하는 객체 지향 프로그래밍 언어이
다. 대형 프로젝트 수행 시 모듈별 분리가 가능하여 개발과 유지 관리에 적합하다.

(6) JAVA
C++에 비해 단순하고 분산 환경 및 보안성을 지원한다. JAVA 언어는 컴파일을 거쳐
야 하며, 컴파일을 통해 생성된 class 파일을 가상 머신을 통해 실행하여야 한다.

(7) JAVASCRIPT
1995년에 개발된 객체 지향 스크립트 언어로 웹 페이지 동작을 구현할 수 있다. 빠른
시간에 코드를 완성할 수 있고 확장성이 좋으며 배우기 쉽다는 장점이 있으나, 보안이
나 성능이 다른 언어에 비하여 부족하다는 단점이 있다.

(8) PERL
텍스트 처리에 주안점을 두고 개발된 인터프리터 언어로 CGI용으로도 많이 사용된다.
변수를 명시적으로 선언할 필요가 없고, 모든 변수가 지정되지 않았을 경우에는 기본
초깃값을 가진다.

(9) PYTHON
배우기 쉽고 이식성이 좋은 언어로 최근 트렌드와 잘 맞는다, 다양한 함수들도 많이
제공되어 스타트업과 글로법 기업에서도 많이 사용한다. PERL 언어처럼 인터프리터
언어이면서 객체 지향 언어, 스크립트 언어이다.

(10) C#
2000년에 .NET 환경에 맞춰 설계된 언어이다. C와 C++의 발전된 형태로, VISUAL
BASIC과 같이 사용자 인터페이스를 쉽게 만드는 컴포넌트 기능을 제공하기도 한다.
.NET 환경에서 실행되기 때문에 .NET 환경이 설치되어야 하고, C# 컴파일러를 필요로
한다.

(11) GOLANG
2009년 Google에서 만든 언어로 짧게 GO라고도 부른다. C 언어와 직접적인 연관을 가
지며, 내장 라이브러리가 많이 지원된다. 대체로 C 언어의 문법과 유사하나 if, for,
switch를 포함한 제어 구조를 가지며, 하드웨어 사양이 낮더라도 빠른 컴파일이 가능
하다는 특징을 가진다.

(12) DART
JAVASCRIPT와 JAVA의 영향을 받아 개발되었으며, 객체 지향적인 언어이다. 백그라운
드에서 작동한다는 점에서 JAVASCRIPT와 차이를 가지고 있으며, JAVASCRIPT와 유사
하나 단순화하였다. 별도의 라이브러리 설치 없이 HTML 페이지를 수정할 수 있다는
특징을 가진다.

(13) CEYLON
JAVA에 기반을 둔 언어로 모듈성을 주요 특징으로 가진다. 코드를 패키지와 모듈로
정리하여 가상 머신에서 컴파일을 수행하며, CEYLON Herd라는 저장소에서 모듈을 발
행한다.

*/